function [A,b] = CreateMatrix(n,value) %建立矩阵
    A = zeros(4*n-1);
    b = zeros(4*n-1,1);
    b(1) = value;
    if n == 1%当n为1时
        A = [3,-1,-1;-1,4,-2;-1,-2,4];
    else%当n>1时
       A(1:1,1:3) = [3,-1,-1]; %矩阵的第一行
        for i = 1:1:n
           if i == 1
               A(2:3,1:5) = [-1,4,-1,0,-1;-1,-1,4,-1,0];
           else
              A(4*i-4:4*i-3, 4*i-6:4*i-1) = [0,-1,4,-1,-1,-1;-1,0,-1,4,-1,-1];%矩阵在每一段电阻网络列写方程时的前两行
              if i ~= n
                   A(4*i-2:4*i-1, 4*i-4:4*i+1) = [-1,-1,4,-1,0,-1;-1,-1,-1,4,-1,0];%不是最后一个电阻网络
              else
                   A(4*i-2:4*i-1, 4*i-4:4*i-1) = [-1,-1,4,-2;-1,-1,-2,4];%最后一个电阻网络
              end
           end           
       end
    end        
end

